In [1]:
import pandas as pd

In [3]:
df_exams = pd.read_csv("StudentsPerformance.csv")
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

# Math Operations

#### OPERATIONS IN COLUMNS

In [6]:
# select a clumn and calculate the sum
math_score_sum = df_exams["math score"].sum()

In [12]:
# count, mean, std, max, min
math_score_count = df_exams["math score"].count()
math_score_mean = df_exams["math score"].mean()
math_score_std = df_exams["math score"].std()
math_score_min = df_exams["math score"].min()
math_score_max = df_exams["math score"].max()
print(math_score_count)
print(math_score_mean)
print(math_score_std)
print(math_score_min)
print(math_score_max)

1000
66.089
15.163080096009468
0
100

In [13]:
# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### OPERATION IN ROWS

In [22]:
# calculating the sum in rows
score_sum = df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"]

In [30]:
# calculating the avarage score and assigning the result to a new column
df_exams["avarage"] = (df_exams["math score"] + df_exams["reading score"] + df_exams["writing score"])/3

In [31]:
df_exams.round(2)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,avarage
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.00
996,male,group C,high school,free/reduced,none,62,55,55,57.33
997,female,group C,high school,free/reduced,completed,59,71,65,65.00
998,female,group D,some college,standard,completed,68,78,77,74.33
999,female,group D,some college,free/reduced,none,77,86,86,83.00

# Value Counts

In [32]:
# counting gender elements by category
df_exams["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [33]:
# return the relative frequency
df_exams["gender"].value_counts(normalize = True)

gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [34]:
# counting "parental level of education" elements by category
df_exams["parental level of education"].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [37]:
df_exams["parental level of education"].value_counts(normalize = True).round(2)

parental level of education
some college          0.23
associate's degree    0.22
high school           0.20
some high school      0.18
bachelor's degree     0.12
master's degree       0.06
Name: proportion, dtype: float64